In [22]:
import pandas as pd

In [23]:
df_amount=pd.read_csv("Aantal kinderen per vrouw (%).csv", sep=';')

In [24]:
df_amount.head(5)

   Jaar Geen kinderen 1 kind 2 kinderen 3 of meer kinderen
0  1935          11,7   10,2       32,5               45,6
1  1936          11,9   10,0       34,6               43,4
2  1937          10,2   10,9       36,5               42,4
3  1938          12,1   10,1       37,7               40,0
4  1939          11,6   10,3       40,1               38,0

In [25]:
df_amount['year']=df_amount.Jaar

In [26]:
df_amount['zero'] = df_amount['Geen kinderen']

In [27]:
df_amount['one'] = df_amount['1 kind']

In [28]:
df_amount['two'] = df_amount['2 kinderen']

In [29]:
df_amount['more'] = df_amount['3 of meer kinderen']

In [30]:
df_amount = df_amount.drop(columns=['Jaar', 'Geen kinderen', '1 kind', '2 kinderen', '3 of meer kinderen'])

In [31]:
df_amount.head(5)

   year  zero   one   two  more
0  1935  11,7  10,2  32,5  45,6
1  1936  11,9  10,0  34,6  43,4
2  1937  10,2  10,9  36,5  42,4
3  1938  12,1  10,1  37,7  40,0
4  1939  11,6  10,3  40,1  38,0

In [34]:
df_age=pd.read_csv("Gemiddelde leeftijd van de moeder (jaar).csv", sep=';')

In [35]:
df_age['year']=df_age.Jaar

In [36]:
df_age['all']=df_age['Bij alle kinderen']

In [37]:
df_age['first']=df_age['Bij eerste kind']

In [38]:
df_age['second']=df_age['Bij tweede kind']

In [39]:
df_age=df_age.drop(columns=['Jaar', 'Bij alle kinderen', 'Bij eerste kind', 'Bij tweede kind'])

In [40]:
df_age.head(5)

   year   all first second
0  1950  30,6  26,4   29,0
1  1951  30,5  26,2   28,9
2  1952  30,4  26,2   28,9
3  1953  30,4  26,2   28,9
4  1954  30,3  26,2   28,8

In [41]:
#graph the amount of kids over time